SELECT 
ST_Contains(`linestring`, `polygon`), /*Получаем 0, так как отрезок не попадает внутрь прямоугольника*/
ST_Intersects(`linestring`, `polygon`), /*Получаем 1, так как отрезок пересекается границея прямоугольника*/
ST_Touches(`linestring`, `polygon`), /*Получаем 1, так как внутренности обоих геометрий не пересекаются, а границы пересекаются*/
ST_Overlaps(`linestring`, `polygon`), /*Получаем NULL так как геометрии имеют разные размерности*/
MBRCovers(`linestring`, `polygon`), /*Получаем 0, так как минимальный ограничивающий прямоугольник для первой геометрии(отрезка) меньше, чем для второй геометрии(прямоугольника)*/
MBRCovers(`polygon`, `linestring`) /*Получаем 1, так как теперь минимальный ограничивающий прямоугоьник для первой геометрии(прямоугольника) покрывает минимальный ограничивающий прямоугольник для второй геометрии(отрезка)*/
FROM `geom`;
